# Kaggle Machine Learning - Intro to ML

Titanic Competition

Submitting Gender Submission returned:

`Your submission scored 0.76555, which is not an improvement of your best score. Keep trying!`

My best score is 0.77511

In [4]:
import pandas as pd
import numpy as np
from sklearn.ensemble import RandomForestClassifier

In [2]:
train_data = pd.read_csv("./data/titanic/train.csv")
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [46]:
test_data = pd.read_csv("./data/titanic/test.csv")
test_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [47]:
test_data.isna().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [5]:
y = train_data["Survived"]
features = ["Pclass", "Sex", "SibSp", "Parch"]
X = train_data[features]

In [6]:
X.head()

   Pclass     Sex  SibSp  Parch
0       3    male      1      0
1       1  female      1      0
2       3  female      0      0
3       1  female      1      0
4       3    male      0      0

In [7]:
X = pd.get_dummies(X)

In [8]:
X.head()

   Pclass  SibSp  Parch  Sex_female  Sex_male
0       3      1      0           0         1
1       1      1      0           1         0
2       3      0      0           1         0
3       1      1      0           1         0
4       3      0      0           0         1

In [9]:
X_test = pd.get_dummies(test_data[features])

In [10]:
X_test.head()

   Pclass  SibSp  Parch  Sex_female  Sex_male
0       3      0      0           0         1
1       3      1      0           1         0
2       2      0      0           0         1
3       3      0      0           0         1
4       3      1      1           1         0

In [45]:
X_test.isna().sum()

Pclass        0
SibSp         0
Parch         0
Sex_female    0
Sex_male      0
dtype: int64

## Create Submission based on Class Notes

In [11]:


model = RandomForestClassifier(n_estimators=100, max_depth=5, random_state=1)
model.fit(X, y)
predictions = model.predict(X_test)

In [12]:
output = pd.DataFrame({'PassengerId': test_data.PassengerId, 'Survived': predictions})
output.to_csv('titanic_submission_1.csv', index=False)
print("Your submission was successfully saved!")

Your submission was successfully saved!

Your submission scored 0.77511, which is not an improvement of your best score. Keep trying!

## Create New Submission

In [236]:
train_data = pd.read_csv("./data/titanic/train.csv")
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [237]:
test_data = pd.read_csv("./data/titanic/test.csv")
test_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [238]:
train_data.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [239]:
def update_missing_age(df):
    v = df.query("Age.notna() & Sex =='female' & Pclass==3")[['Age']].mean().values[0]
    df.loc[(df['Age'].isna()) & (df['Sex']=='female') & (df['Pclass']==3), 'Age']=v

    v = df.query("Age.notna() & Sex =='female' & Pclass==2")[['Age']].mean().values[0]
    df.loc[(df['Age'].isna()) & (df['Sex']=='female') & (df['Pclass']==2), 'Age']=v

    v = df.query("Age.notna() & Sex =='female' & Pclass==1")[['Age']].mean().values[0]
    df.loc[(df['Age'].isna()) & (df['Sex']=='female') & (df['Pclass']==1), 'Age']=v

    v = df.query("Age.notna() & Sex =='male' & Pclass==3")[['Age']].mean().values[0]
    df.loc[(df['Age'].isna()) & (df['Sex']=='male') & (df['Pclass']==3), 'Age']=v

    v = df.query("Age.notna() & Sex =='male' & Pclass==2")[['Age']].mean().values[0]
    df.loc[(df['Age'].isna()) & (df['Sex']=='male') & (df['Pclass']==2), 'Age']=v

    v = df.query("Age.notna() & Sex =='male' & Pclass==1")[['Age']].mean().values[0]
    df.loc[(df['Age'].isna()) & (df['Sex']=='male') & (df['Pclass']==1), 'Age']=v

In [240]:
update_missing_age(train_data)

In [241]:
train_data.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [242]:
import re
deck = {"A": 1, "B": 2, "C": 3, "D": 4, "E": 5, "F": 6, "G": 7, "U": 8}
data = [train_data, test_data]

for dataset in data:
    dataset['Cabin'] = dataset['Cabin'].fillna("U0")
    dataset['Deck'] = dataset['Cabin'].map(lambda x: re.compile("([a-zA-Z]+)").search(x).group())
    dataset['Deck'] = dataset['Deck'].map(deck)
    dataset['Deck'] = dataset['Deck'].fillna(0)
    dataset['Deck'] = dataset['Deck'].astype(int)
# # we can now drop the cabin feature
# train_df = train_df.drop(['Cabin'], axis=1)
# test_df = test_df.drop(['Cabin'], axis=1)

In [243]:
train_data.drop(columns=['Cabin'], inplace=True)

In [244]:
train_data.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
Deck           0
dtype: int64

In [245]:
train_data['Embarked'].describe()

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

In [246]:
train_data['Embarked'] = train_data['Embarked'].fillna('S')

In [247]:
test_data['Embarked'] = test_data['Embarked'].fillna('S')

In [248]:
test_data.isna().sum()

PassengerId     0
Pclass          0
Name            0
Sex             0
Age            86
SibSp           0
Parch           0
Ticket          0
Fare            1
Cabin           0
Embarked        0
Deck            0
dtype: int64

In [249]:
update_missing_age(test_data)

In [250]:
test_data.isna().sum()

PassengerId    0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           1
Cabin          0
Embarked       0
Deck           0
dtype: int64

In [251]:
test_data.drop(columns=['Cabin'], inplace=True)

### Fare

In [252]:
test_data.query("Fare.isna()")

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Deck
152,1044,3,"Storey, Mr. Thomas",male,60.5,0,0,3701,NaN,S,8

In [253]:
test_data.groupby(['Pclass'])[["Fare"]].mean()

             Fare
Pclass
1       94.280297
2       22.202104
3       12.459678

In [254]:

test_data['Fare'].iloc[152] = 12.45

/Users/patryan/.virtualenvs/kaggle-env/lib/python3.8/site-packages/pandas/core/indexing.py:1636: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_block(indexer, value, name)

In [255]:
test_data.isna().sum()

PassengerId    0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
Deck           0
dtype: int64

In [256]:
train_data['Fare'] = train_data['Fare'].astype(int)
test_data['Fare'] = test_data['Fare'].astype(int)

In [257]:
train_data['Age'] = train_data['Age'].astype(int)
test_data['Age'] = test_data['Age'].astype(int)

### Title

https://towardsdatascience.com/predicting-the-survival-of-titanic-passengers-30870ccc7e8

In [258]:
data = [train_data, test_data]
titles = {"Mr": 1, "Miss": 2, "Mrs": 3, "Master": 4, "Rare": 5}

for dataset in data:
    # extract titles
    dataset['Title'] = dataset.Name.str.extract(' ([A-Za-z]+)\.', expand=False)
    # replace titles with a more common title or as Rare
    dataset['Title'] = dataset['Title'].replace(['Lady', 'Countess','Capt', 'Col','Don', 'Dr',\
                                            'Major', 'Rev', 'Sir', 'Jonkheer', 'Dona'], 'Rare')
    dataset['Title'] = dataset['Title'].replace('Mlle', 'Miss')
    dataset['Title'] = dataset['Title'].replace('Ms', 'Miss')
    dataset['Title'] = dataset['Title'].replace('Mme', 'Mrs')
    # convert titles into numbers
    dataset['Title'] = dataset['Title'].map(titles)
    # filling NaN with 0, to get safe
    dataset['Title'] = dataset['Title'].fillna(0)
train_data = train_data.drop(['Name'], axis=1)
test_data = test_data.drop(['Name'], axis=1)

In [259]:
y = train_data["Survived"]
features = ["Pclass", "Sex", "Age", "SibSp", "Parch", "Embarked", "Deck", "Fare", "Title"]
X = train_data[features]

In [260]:
X = pd.get_dummies(X)

In [261]:
X_test = pd.get_dummies(test_data[features])

In [262]:
X.head()

,Pclass,Age,SibSp,Parch,Deck,Fare,Title,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,3,22,1,0,8,7,1,0,1,0,0,1
1,1,38,1,0,3,71,3,1,0,1,0,0
2,3,26,0,0,8,7,2,1,0,0,0,1
3,1,35,1,0,3,53,3,1,0,0,0,1
4,3,35,0,0,8,8,1,0,1,0,0,1

In [263]:
model = RandomForestClassifier(n_estimators=100, criterion = "gini", min_samples_leaf = 1, min_samples_split = 10)
model.fit(X, y)
predictions = model.predict(X_test)
output = pd.DataFrame({'PassengerId': test_data.PassengerId, 'Survived': predictions})
output.to_csv('titanic_submission_7.csv', index=False)
print("Your submission was successfully saved!")

Your submission was successfully saved!

---
titanic_submission_2.csv

Your submission scored 0.78708, which is an improvement of your previous score of 0.77511. Great job!

--- 

titanic_submission_3.csv

Add the Deck column did NOT help

Your submission scored 0.78708, which is not an improvement of your best score. Keep trying!

---
titanic_submission_4.csv

Add Fare - it was just a miss to not have it initially

Your submission scored 0.77990, which is not an improvement of your best score. Keep trying!

---
titanic_submission_5.csv

did not improve

---
titanic_submission_6.csv

changed model hyperparmeters

Your submission scored 0.76315, which is not an improvement of your best score. Keep trying!

In [264]:
train_data.dtypes

PassengerId     int64
Survived        int64
Pclass          int64
Sex            object
Age             int64
SibSp           int64
Parch           int64
Ticket         object
Fare            int64
Embarked       object
Deck            int64
Title           int64
dtype: object